{
  "irVersion": "1.0",
  "project": "ffutil",
  "repository": "https://github.com/grokify/ffutil",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.1.0",
      "date": "2026-02-21",
      "highlights": [
        { "description": "Go wrapper for FFmpeg and FFprobe with type-safe command building, media probing, and hardware encoder detection" }
      ],
      "added": [
        { "description": "Type-safe command builder with fluent API for constructing FFmpeg commands", "commit": "3446971" },
        { "description": "`Probe()` function returning detailed media info (duration, resolution, codecs, streams)", "commit": "3446971" },
        { "description": "`Duration()`, `Resolution()`, `HasAudio()`, `HasVideo()` convenience functions", "commit": "3446971" },
        { "description": "Hardware encoder detection with `BestH264Encoder()` and `BestHEVCEncoder()`", "commit": "3446971" },
        { "description": "Cross-platform support for VideoToolbox (macOS), NVENC (NVIDIA), QuickSync (Intel), AMF (AMD), VA-API (Linux)", "commit": "3446971" },
        { "description": "`Version()`, `ProbeVersion()`, `Available()` for checking FFmpeg/FFprobe installation", "commit": "3446971" },
        { "description": "`ListEncoders()` function to enumerate all available video encoders", "commit": "3446971" }
      ],
      "documentation": [
        { "description": "README with comprehensive API reference and usage examples", "commit": "3446971" }
      ],
      "tests": [
        { "description": "Unit tests for command builder, encoder detection, and probe functions", "commit": "3446971" }
      ]
    }
  ]
}
